---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.IndexBuffer
source: html/62c694f2-144e-4656-6dc5-5e7a7921ae0f.htm
---
# IndexBuffer Members

Constructs the index buffer with the given capacity, measured in short integers.